2024-07-07-parallel-evm:-bnb-chain.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta
      name="description"
      content="This is a personal note for [[https://www.bnbchain.org/zh-CN/blog/road-to-high-performance-parallel-evm-for-bnb-chain][BNB chain-blog]]"
    />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://chenyo-17.github.io/org-static-blog/rss.xml"
      title="RSS feed for https://chenyo-17.github.io/org-static-blog"
    />
    <title>Parallel EVM: BNB chain</title>
    <meta name="author" content="chenyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="assets/style.css" type="text/css" />
  </head>
  <body>
    <div id="preamble" class="status">
      <header>
        <h1>
          <a href="https://chenyo-17.github.io/org-static-blog"
            >Chenyo's org-static-blog</a
          >
        </h1>
        <nav>
          <a href="https://chenyo-17.github.io/org-static-blog">Home</a>
          <a href="archive.html">Archive</a>
          <a href="tags.html">Tags</a>
          <div id="search-container">
            <input
              type="text"
              id="search-input"
              placeholder="Search anywhere..."
            />
          </div>
        </nav>
      </header>
    </div>
    <div id="content">
      <div class="post-date">07 Jul 2024</div>
      <h1 class="post-title">
        <a
          href="https://chenyo-17.github.io/org-static-blog/2024-07-07-parallel-evm:-bnb-chain.html"
          >Parallel EVM: BNB chain</a
        >
      </h1>
      <nav id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li>
              <a href="#org1e321eb">1. Blockchain fundamentals</a>
              <ul>
                <li>
                  <a href="#org7ce42a7">1.1. Why is parallel EVM not easy</a>
                </li>
                <li><a href="#org95a0ea8">1.2. A Parallel EVM ideas</a></li>
                <li><a href="#org2aa593d">1.3. Block STM algorithm</a></li>
              </ul>
            </li>
            <li>
              <a href="#orgf7b0d41">2. BNB Parallel EVM 1.0: Infrastructure</a>
            </li>
            <li>
              <a href="#orgba5123c"
                >3. BNB Parallel EVM 2.0: Performance enhancement</a
              >
            </li>
            <li>
              <a href="#org7ffa536">4. BNB Parallel EVM 3.0: Production</a>
              <ul>
                <li><a href="#orgfe0328f">4.1. Hint-based dispatcher</a></li>
                <li>
                  <a href="#org923da56"
                    >4.2. Seamless BNB chain ecosystem integration</a
                  >
                </li>
              </ul>
            </li>
            <li>
              <a href="#org59be992">5. Comparison with other solutions</a>
            </li>
            <li><a href="#org5de26f0">6. Other optimizations</a></li>
          </ul>
        </div>
      </nav>
      <p>
        This is a personal note for
        <a
          href="https://www.bnbchain.org/zh-CN/blog/road-to-high-performance-parallel-evm-for-bnb-chain"
          >BNB chain-blog</a
        >.
      </p>
      <div id="outline-container-org1e321eb" class="outline-2">
        <h2 id="org1e321eb">
          <span class="section-number-2">1.</span> Blockchain fundamentals
        </h2>
        <div class="outline-text-2" id="text-1"></div>
        <div id="outline-container-org7ce42a7" class="outline-3">
          <h3 id="org7ce42a7">
            <span class="section-number-3">1.1.</span> Why is parallel EVM not
            easy
          </h3>
          <div class="outline-text-3" id="text-1-1">
            <ul class="org-ul">
              <li>Lack of visibility of potential transaction conflict.</li>
              <li>
                Blockchains experience transaction bursts, e.g., &gt;70M
                transactions per day.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org95a0ea8" class="outline-3">
          <h3 id="org95a0ea8">
            <span class="section-number-3">1.2.</span> A Parallel EVM ideas
          </h3>
          <div class="outline-text-3" id="text-1-2">
            <ul class="org-ul">
              <li>
                Run multiple EVM instances concurrently on different threads.
              </li>
              <li>
                Execute transactions independently on each thread and later
                merge a finial state update.
              </li>
              <li>
                <a
                  href="https://lh7-us.googleusercontent.com/Dh1GAMYlMkiRI0xWQ0ByYOxq_GNtA9h1PP1OF7FP9b8O3VRxVtlh1eq991OlNa4rNX_ZXH8tVPRBeN58_0dBF1jPUVRuuJMl4JqmBchhCTZp_vF-W003l77KajIjIMCHfapjsBH--0EpMi0FT2iNPlw"
                  >Parallel EVM scheme</a
                >
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org2aa593d" class="outline-3">
          <h3 id="org2aa593d">
            <span class="section-number-3">1.3.</span> Block STM algorithm
          </h3>
          <div class="outline-text-3" id="text-1-3">
            <ul class="org-ul">
              <li>
                Optimistic parallelism: assigns transactions to various threads.
              </li>
              <li>
                Software transaction memory (STM): detect conflicts when
                transactions try to modify the same shared state simultaneously.
              </li>
              <li>
                Conflict resolution: when conflicts are detected, the offending
                transactions are discarded without affecting the blockchain
                state and are re-executed.
              </li>
            </ul>
          </div>
        </div>
      </div>
      <div id="outline-container-orgf7b0d41" class="outline-2">
        <h2 id="orgf7b0d41">
          <span class="section-number-2">2.</span> BNB Parallel EVM 1.0:
          Infrastructure
        </h2>
        <div class="outline-text-2" id="text-2">
          <ul class="org-ul">
            <li>
              Proposal:
              <a
                href="https://github.com/bnb-chain/BEPs/pull/130?ref=bnbchain.ghost.io"
                >BEP-130 (2022)</a
              >
            </li>
            <li>
              Dispatcher: distributes transactions across threads to optimize
              throughput.
            </li>
            <li>
              Parallel execution engine: execute transactions independently on
              each thread.
            </li>
            <li>
              Local stateDB: each thread maintains a local stateDB to record
              state access.
            </li>
            <li>
              Conflict detection: detect conflicts and re-execute conflicting
              transactions.
            </li>
            <li>
              State commit: the finalized results are committed to the global
              state DB.
            </li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orgba5123c" class="outline-2">
        <h2 id="orgba5123c">
          <span class="section-number-2">3.</span> BNB Parallel EVM 2.0:
          Performance enhancement
        </h2>
        <div class="outline-text-2" id="text-3">
          <ul class="org-ul">
            <li>
              Dispatcher: combine both static and dynamic dispatch strategies.
            </li>
            <li>
              Execution engine: streaming pipeline to enable smooth transaction
              processing.
            </li>
            <li>
              Conflict detection: ensure data integrity while minimizing
              unnecessary re-execution.
            </li>
            <li>
              Memory: shared memory pools and light copying techniques to reduce
              memory footprint.
            </li>
            <li>The overall performance ranges from 20% to 50%.</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-org7ffa536" class="outline-2">
        <h2 id="org7ffa536">
          <span class="section-number-2">4.</span> BNB Parallel EVM 3.0:
          Production
        </h2>
        <div class="outline-text-2" id="text-4"></div>
        <div id="outline-container-orgfe0328f" class="outline-3">
          <h3 id="orgfe0328f">
            <span class="section-number-3">4.1.</span> Hint-based dispatcher
          </h3>
          <div class="outline-text-3" id="text-4-1">
            <ul class="org-ul">
              <li>
                leverages external hint providers to analyze transactions and
                generate predictions about potential state access conflicts.
              </li>
              <li>
                Simple hints include read/write state sets; advanced hints
                incorporate weak/strong ordering for optimal parallelism.
              </li>
              <li>Conflicting transactions are assigned to the same slot.</li>
              <li>
                Transactions with no conflicts are distributed across different
                slots.
              </li>
              <li>
                Conflict detector remains as a backup for handling unforeseen
                conflicts.
              </li>
            </ul>
          </div>
        </div>
        <div id="outline-container-org923da56" class="outline-3">
          <h3 id="org923da56">
            <span class="section-number-3">4.2.</span> Seamless BNB chain
            ecosystem integration
          </h3>
          <div class="outline-text-3" id="text-4-2">
            <ul class="org-ul">
              <li>Modularization and reconstructing.</li>
              <li>Thorough testing and validation.</li>
            </ul>
          </div>
        </div>
      </div>
      <div id="outline-container-org59be992" class="outline-2">
        <h2 id="org59be992">
          <span class="section-number-2">5.</span> Comparison with other
          solutions
        </h2>
        <div class="outline-text-2" id="text-5">
          <table>
            <colgroup>
              <col class="org-left" />

              <col class="org-left" />

              <col class="org-left" />

              <col class="org-left" />
            </colgroup>
            <thead>
              <tr>
                <th scope="col" class="org-left">Solutions</th>
                <th scope="col" class="org-left">TX dependency check</th>
                <th scope="col" class="org-left">Conflict resolution</th>
                <th scope="col" class="org-left">StateDB optimization</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td class="org-left">BlockSTM</td>
                <td class="org-left">tracks at execution</td>
                <td class="org-left">re-execution</td>
                <td class="org-left">N/A</td>
              </tr>

              <tr>
                <td class="org-left">Polygon</td>
                <td class="org-left">minimal metadata solution</td>
                <td class="org-left">reduced re-execution</td>
                <td class="org-left">N/A</td>
              </tr>

              <tr>
                <td class="org-left">Monad</td>
                <td class="org-left">static analysis</td>
                <td class="org-left">reduced re-execution</td>
                <td class="org-left">Monad DB</td>
              </tr>

              <tr>
                <td class="org-left">Sei</td>
                <td class="org-left">tracks at execution</td>
                <td class="org-left">re-execution</td>
                <td class="org-left">SeiDB</td>
              </tr>

              <tr>
                <td class="org-left">Neon EVM and Solana Sealevel</td>
                <td class="org-left">contract provided</td>
                <td class="org-left">reduced re-execution</td>
                <td class="org-left">depends on Solana</td>
              </tr>

              <tr>
                <td class="org-left">BNBChain</td>
                <td class="org-left">hint info</td>
                <td class="org-left">reduced or eliminated re-execution</td>
                <td class="org-left">Thread local DB</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>
      <div id="outline-container-org5de26f0" class="outline-2">
        <h2 id="org5de26f0">
          <span class="section-number-2">6.</span> Other optimizations
        </h2>
        <div class="outline-text-2" id="text-6">
          <ul class="org-ul">
            <li>
              Opcode-level optimization: fine-tuning individual EVM instructions
              for maximum efficiency.
            </li>
            <li>
              Compilation optimization: JIT/AOT compilation paradigms;
              instruction-level parallelism (SIMD).
            </li>
            <li>
              Database sharding: distribute data across multiple databases.
            </li>
            <li>Concurrent node execution.</li>
          </ul>
        </div>
      </div>
      <div class="taglist">
        <a href="https://chenyo-17.github.io/org-static-blog/tags.html">Tags</a
        >:
        <a href="https://chenyo-17.github.io/org-static-blog/tag-evm.html"
          >evm</a
        >
        <a
          href="https://chenyo-17.github.io/org-static-blog/tag-parallel-evm.html"
          >parallel-evm</a
        >
        <a href="https://chenyo-17.github.io/org-static-blog/tag-bnb.html"
          >bnb</a
        >
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="search-results"></div>
      <footer>
        <p>© 2024 chenyo. Some rights reserved.</p>
      </footer>
    </div>
  </body>
</html>
